{
    "aggregation-information-phishing-schemes": "Collecting data obtained through phishing attacks on web pages, email accounts, etc…",
    "benign": "The event was neither dangerous nor malicious and was not suspected to be malicious or dangerous.",
    "blocked": "The event was suspected to be malicious and was blocked.",
    "brute-force-attempt": "Unsuccessful login attempt by using sequential credentials for gaining access to the system.",
    "c&c-server-hosting": "Web page disseminating one or various types of malware.",
    "compromised-system": "Attackers obtained control of a compromised system.",
    "confirmed": "The event was confirmed to be tied to an incident and response is underway.",
    "connection-malware-port": "System attempting to gain access to a port normally linked to a specific type of malware.",
    "connection-malware-system": "System attempting to gain access to an IP address or URL normally linked to a specific type of malware, e.g. C&C or a distribution page for components linked to a specific botnet.",
    "content-forbidden-by-law": "Distribution or sharing of illegal content such as child pornography, racism, xenophobia, etc",
    "control-system-bypass": "Unauthorized access to a system or component by bypassing an access control system in place.",
    "copyrighted-content": "Distribution or sharing of content protected by copyright and related rights.",
    "data-exfiltration": "Unauthorized access to and sharing of a specific set of information.",
    "deferred": "The event is deferred due to resource constraints, information types or external reasons.",
    "deletion-information": "Unauthorized deleting of a specific set of information.",
    "denial-of-service": "The event or incident resulted in a loss of availability for a service or system. Incidents of this type SHOULD have an availability impact, but organizations may choose to not share the details of these impacts.",
    "destruction": "The event or incident destroyed data or systems. Incidents of this SHOULD have an integrity impact, but organizations may choose to not share the details of these impacts.",
    "dictionary-attack-attempt": "Unsuccessful login attempt by using system access credentials previously loaded into a dictionary.",
    "discarded": "The event was discarded due to resource constraints, information types or external reasons.",
    "disruption-data-transmission": "Logical and physical activities aimed at causing damage to information or at preventing its transmission among systems.",
    "dissemination-malware-email": "Malware attached to a message or email message containing link to malicious URL.",
    "dissemination-phishing-emails": "Mass emailing aimed at collecting data for phishing purposes with regard to the victims.",
    "dns-cache-poisoning": "DNS cache poisoning - also known as DNS spoofing, is a type of cyber attack in which an attacker corrupts a DNS resolver’s cache by injecting false DNS records, causing the resolver to records controlled by the attacker.",
    "dns-local-resolver-hijacking": "Consumer Premise Equipment (CPE), such as home routers, often provide DNS recursion on the local network. If the CPE device is compromised, the attacker can change the recursive resolver behavior; for example, by changing responses.",
    "dns-spoofing-registered": "In a context where a domain name is expected (such as the From header in mail or a URL in a web page or message body), supplying a domain name not controlled by the attacker and that is in fact controlled by or registered to a legitimate registrant.",
    "dns-rebinding": "DNS rebinding - a type of attack where a malicious website directs a client to a local network address, allowing the attacker to bypass the same-origin policy and gain access to the victim’s local resources.",
    "dns-server-compromise": "Attacker gains administrative privileges on an open recursive DNS server, authoritative DNS server, organizational recursive DNS server, or ISP-operated recursive DNS server.",
    "dns-spoofing-unregistered": "In a context where a domain name is expected (such as the From header in mail or a URL in a web page or message body), supplying a domain name not controlled by the attacker and that is not controlled by or registered to a legitimate registrant.",
    "dns-stub-resolver-hijacking": "The attacker compromises the Operating System of a computer or a phone with malicious code that intercepts and responds to DNS queries with rogue or malicious responses.",
    "dns-zone-transfer": "Transfer of a specific DNS zone.",
    "domain-name-compromise": "The wrongfully taking control of a domain name from the rightful name holder. Compromised domains can be used for different kinds of malicious activity like sending spam or phishing, for distributing malware or as botnet command and control.",
    "duplicate": "This event is a duplicate of another event. A relationship should be created between this event and the event it duplicates.",
    "email-flooding": "Sending an unusually large quantity of email messages.",
    "equipment-loss": "A loss of control of physical equipment that is not known to be theft.",
    "equipment-theft": "Theft of equipment. In general this should be paired with equipment-loss.",
    "exploit": "Successful use of a tool exploiting a specific vulnerability of the system.",
    "exploit-attempt": "Unsuccessful use of a tool exploiting a specific vulnerability of the system.",
    "exploit-framework-exhausting-resources": "Various sources using specially designed software to affect the normal functioning of a specific service, by exploiting a vulnerability.",
    "exploit-tool-exhausting-resources": "One single source using specially designed software to affect the normal functioning of a specific service, by exploiting a vulnerability.",
    "failed": "The event failed its suspected goal.",
    "file-inclusion": "Inclusion of files into a system under attack with the use of file inclusion techniques.",
    "file-inclusion-attempt": "Unsuccessful attempt to include files in the system under attack by using file inclusion techniques.",
    "hosting-malware-webpage": "Web page disseminating one or various types of malware.",
    "hosting-phishing-sites": "Hosting web sites for phishing purposes.",
    "illegitimate-use-name": "Using the name of an institution without permission to do so.",
    "illegitimate-use-resources": "Use of institutional resources for purposes other than those intended.",
    "infected-by-known-malware": "The presence of any of the types of malware was detected in a system.",
    "insufficient-data": "Not enough data is available to assess this event.",
    "known-malware": "This incident involves a known type of malware. Events and incidents SHOULD be related to a Malware object, but organizations may choose not to share the details on this malware.",
    "lame-delegations": "Lame delegations occur as a result of expired name server domains allowing attackers to take control of the domain resolution by re-registering this expired name server domain.",
    "major": "The incident is classified as major based on the internal criteria within the organization or due to external reporting requirements.",
    "modification-information": "Unauthorized changes to a specific set of information.",
    "misconfiguration": "A false positive where this event was triggered by a misconfiguration.",
    "natural": "The event was due to natural causes such as an earthquake or hurricane.",
    "negotiation": "Negotiation of a deal or payment amount.",
    "network-scanning": "Scanning a network aimed at identifying systems which are active in the same network.",
    "no-apt": "It is not believed that this incident involved an advanced persistent threat.",
    "packet-flood": "Mass mailing of requests (network packets, emails, etc…​) from various sources to a specific service, aimed at affecting its normal functioning.",
    "password-cracking-attempt": "Attempt to acquire access credentials by breaking the protective cryptographic keys.",
    "policy-violation": "The event or incident was a violation of organizational or regulatory policy.",
    "ransomware": "This incident involved malware that encrypted data with a demand that a ransom is paid to regain access to it.",
    "ransomware-payment": "The event or incident associated with actually paying a ransom.",
    "refuted": "The event was previously suspected to have achieved a goal, but this has since been refuted.",
    "scan-probe": "Event was triggered based on scanning activity",
    "silently-discarded": "The event was silently discarded due to resource constraints, information types or external reasons.",
    "supply-chain-customer": "This incident used a vendor further up in the supply chain where the target was a customer.",
    "supply-chain-vendor": "This incident targeted a system or product that is supplied to others to enable further attacks.",
    "spam": "Sending an email message that was unsolicited or unwanted by the recipient.",
    "sql-injection": "Manipulation or reading of information contained in a database by using the SQL injection technique.",
    "sql-injection-attempt": "Unsuccessful attempt to manipulate or read the information of a database by using the SQL injection technique.",
    "successful": "The event is believed to have succeeded in its goal.",
    "system-probe": "Single system scan searching for open ports or services using these ports for responding.",
    "theft-access-credentials": "Unauthorized access to a system or component by using stolen access credentials.",
    "unattributed": "This event or incident has not been attributed. It is unclear if it is tied to a specific advanced persistent threat group.",
    "unauthorized-access-information": "Unauthorized access to a set of information. Incidents of this SHOULD have a confidentiality impact, but organizations may choose to not share the details of these impacts.",
    "unauthorized-access-system": "Unauthorized access to a system or component.",
    "unauthorized-equipment": "Usage of unauthorized devices as part of the incident",
    "unauthorized-release": "The unauthorized release of information.Incidents of this SHOULD have a confidentiality impact, but organizations may choose to not share the details of these impacts.",
    "unauthorized-use": "The usage of information that falls outside of official purposes",
    "undetermined": "Field aimed at the classification of unprocessed events, which have remained undetermined from the beginning.",
    "unintentional": "The event was due to unintentional activity.",
    "unknown-apt": "This incident is believed to involve an advanced persistent threat, but the specific APT is unknown.",
    "unspecified": "Other unlisted events.",
    "vandalism": "Logical and physical activities which - although they are not aimed at causing damage to information or at preventing its transmission among systems - have this effect.",
    "wiretapping": "Logical or physical interception of communications.",
    "worm-spreading": "System infected by a worm trying to infect other systems.",
    "xss": "Attacks performed with the use of cross-site scripting techniques.",
    "xss-attempt": "Unsuccessful attempts to perform attacks by using cross-site scripting techniques."
}