[
    {
        "key": "amplification",
        "label": "Specifies infrastructure used for conducting amplification attacks."
    },
    {
        "key": "anonymization",
        "label": "Specific infrastructure used for anonymization, such as a proxy."
    },
    {
        "key": "botnet",
        "label": "Specifies the membership/makeup of a botnet, in terms of the network addresses of the hosts that comprise the botnet."
    },
    {
        "key": "command-and-control",
        "label": "Specifies infrastructure used for command and control (C2). This is typically a domain name or IP address."
    },
    {
        "key": "control-system",
        "label": "Specifies equipment such as IoT, HMI, RTU, PLC or other ICS devices."
    },
    {
        "key": "exfiltration",
        "label": "Specifies infrastructure used as an endpoint for data exfiltration."
    },
    {
        "key": "firewall",
        "label": "Specifies a device that inspects network traffic and restricts it based upon defined policies."
    },
    {
        "key": "hosting-malware",
        "label": "Specifies infrastructure used for hosting malware."
    },
    {
        "key": "hosting-target-lists",
        "label": "Specifies infrastructure used for hosting a list of targets for DDOS attacks, phishing, and other malicious activities. This is typically a domain name or IP address."
    },
    {
        "key": "phishing",
        "label": "Specifies infrastructure used for conducting phishing attacks."
    },
    {
        "key": "reconnaissance",
        "label": "Specifies infrastructure used for conducting reconnaissance activities."
    },
    {
        "key": "routers-switches",
        "label": "Specifies IT infrastructure used to connect devices to the network."
    },
    {
        "key": "staging",
        "label": "Specifies infrastructure used for staging."
    },
    {
        "key": "workstation",
        "label": "Specifies an endpoint machine used for work by an organization that needs protection."
    },
    {
        "key": "unknown",
        "label": "Specifies an infrastructure of some unknown type."
    }
]