{
    "activist": "Highly motivated, potentially destructive supporter of a social or political cause (e.g., trade, labor, environment, etc.) that attempts to disrupt an organization's business model or damage their image.\n\nThis category includes actors sometimes referred to as anarchists, cyber vandals, extremists, and hacktivists.",
    "competitor": "An organization that competes in the same economic marketplace.\n\nThe goal of a competitor is to gain an advantage in business with respect to the rival organization it targets. It usually does this by copying intellectual property, trade secrets, acquisition strategies, or other technical or business data from a rival organization with the intention of using the data to bolster its own assets and market position.",
    "crime-syndicate": "An enterprise organized to conduct significant, large-scale criminal activity for profit.\n\nCrime syndicates, also known as organized crime, are generally large, well-resourced groups that operate to create profit from all types of crime.",
    "criminal": "Individual who commits computer crimes, often for personal financial gain and often involves the theft of something valuable.\n\nIntellectual property theft, extortion via ransomware, and physical destruction are common examples. A criminal as defined here refers to those acting individually or in very small or informal groups. For sophisticated organized criminal activity, see the crime syndicate descriptor.",
    "hacker": "An individual that tends to break into networks for the thrill or the challenge of doing so.\n\nHackers may use advanced skills or simple attack scripts they have downloaded.",
    "insider-accidental": "A non-hostile insider who unintentionally exposes the organization to harm.\n\n'Insider' in this context includes any person extended internal trust, such as regular employees, contractors, consultants, and temporary workers.",
    "insider-disgruntled": "Current or former insiders who seek revengeful and harmful retaliation for perceived wrongs.\n\n'Insider' in this context includes any person extended internal trust, such as regular employees, contractors, consultants, and temporary workers.\n\nDisgruntled threat actors may have extensive knowledge that can be leveraged when conducting attacks and can take any number of actions including sabotage, violence, theft, fraud, espionage, or embarrassing individuals or the organization.",
    "nation-state": "Entities who work for the government or military of a nation state or who work at their direction.\n\nThese actors typically have access to significant support, resources, training, and tools and are capable of designing and executing very sophisticated and effective Intrusion Sets and Campaigns.",
    "sensationalist": "Seeks to cause embarrassment and brand damage by exposing sensitive information in a manner designed to cause a public relations crisis.\n\nA sensationalist may be an individual or small group of people motivated primarily by a need for notoriety. Unlike the activist, the sensationalist generally has no political goal, and is not using bad PR to influence the target to change its behavior or business practices.",
    "spy": "Secretly collects sensitive information for use, dissemination, or sale.\n\nTraditional spies (governmental and industrial) are part of a well-resourced intelligence organization and are capable of very sophisticated clandestine operations. However, insiders such as employees or consultants acting as spies can be just as effective and damaging, even when their activities are largely opportunistic and not part of an overall campaign.",
    "terrorist": "Uses extreme violence to advance a social or political agenda as well as monetary crimes to support its activities.\n\nIn this context a terrorist refers to individuals who target noncombatants with violence to send a message of fear far beyond the actual events. They may act independently or as part of a terrorist organization.\n\nTerrorist organizations must typically raise much of their operating budget through criminal activity, which often occurs online. Terrorists are also often adept at using and covertly manipulating social media for both recruitment and impact.",
    "unknown": "There is not enough information available to determine the type of threat actor."
}